fix(ci): markdown linter errors
